jmharvey1/ESP32S3_CW_Machine/src/main.cpp
/*
 Note 1: parts of the BT-Keyboard code (bt_keyboard.cpp) was based on source code with the same file name &
   Copyright (c) 2020 by Guy Turcotte
  see MIT License. Look at file licenses.txt for details.
  Note 2: for IDF 5.2 keneral code, i2c_master.c has been modified, at function 'i2c_master_transmit_receive()',
  after line 'ESP_RETURN_ON_ERROR(s_i2c_asynchronous_transaction(i2c_dev, i2c_ops, DIM(i2c_ops), xfer_timeout_ms), TAG, "I2C transaction failed");'
  added this entry: 'vTaskDelay(2);'
  This stopped random crashes related to gt911 touch procssing.
  Also added this statement, two places, in the same file, 
  free(i2c_dev->master_bus->anyc_write_buffer[i2c_dev->master_bus->index]);
  at lines 984, & 1023.

  Note 2: Update LVGLMsgBox.h file to get the REV DAtE to update on the Main Screen's title line.
*/
/*Note 3: When creating a new lvgl/WaveShare LCD/ESP32s3 project, to run menuconfig, & set the following settings:
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y [should align with PSRAM]
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y and CONFIG_SPIRAM_SPEED_120M=y [should align with PSRAM]
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
#The following LVGL configuration can improve the frame rate (LVGL v8.3):
#define LV_MEM_CUSTOM 1 or CONFIG_LV_MEM_CUSTOM=y
#define LV_MEMCPY_MEMSET_STD 1 or CONFIG_LV_MEMCPY_MEMSET_STD=y
#define LV_ATTRIBUTE_FAST_MEM IRAM_ATTR or CONFIG_LV_ATTRIBUTE_FAST_MEM=y
*/
/*initially had an issue wid stack overflow with  "A stack overflow in task esp_ble_hidh_ev".
went to: esp-idf/components/esp_hid/src/ble_hidd.c line 974
and found code that looked like this:
esp_event_loop_args_t event_task_args = {
        .queue_size = 5,
        .task_name = "ble_hidd_events",
        .task_priority = uxTaskPriorityGet(NULL),
        .task_stack_size = 2048,
        .task_core_id = tskNO_AFFINITY
    };
 changed .task_stack_size = 5120, 
 Correction 20240829
 think the real place to set the task stack size is in
 the "bool BTKeyboard::setup(pid_handler *handler, BTKeyboard *KBptr)"
 method, found in, 'bt_keyboard.cpp'  
*/
/*20240729 Fully functional but needs refinement*/
/*20240822 Now support Keyboard battery state, but subject to crashing when running app tries to connect to keyboard a 2nd time*/
/*20240828 Added BIAS auto-correction to ADC sampling */
/*20240828 Moved modified i2c_master.c file plus support .h file to local project lib directory*/
/*20240828 Moved CW Key output from UART TX to UART RX (GPIO44) */
/*20240901 Removed full path reference, & reworked applying advance parser corrections */
/*20240902 LVGLMsgBox.cpp - re-instated setStrTxtFlg(bool flg) - mainly to clear F1 Memory */
/*20240903 re-worked keyboard 'delete' key handling */
/*20240904 LVGLMsgBox.cpp - re-worked cursor management, in send test area, to improve outgoing character hilighting */
/*20240924 LVGLMsgBox.cpp - reworked Update_textarea() when 'capping the ta buffer to take in account character width & word breaks*/
/*20240925 locked down espidf version & i2c_master.h updated i2c_device_config_t definition/structure */
/*20241026 Added 'F9' Scope Screen */
/*20241028 Added IIR tracking filter to ADC processing*/
/*20241031 Reworked postparsing replace text process/code*/
/*20241103 added direct Linking of Settings Screen Debug setting to advance parser's Dbug property */
/*20241104 added ScopeActive flag to better syncronize when its OK to update the 'SCOPE' screen*/
/*20241105 added F1 stored memory contents to main screen & Help Screen */
/*20241112 Added 'F8' Day/Night mode per request from Carl (VK5CT)*/
/*20241113 reworked Night mode sig strenght bar color*/
/*20241115 Added Night mode to saved settings*/
/*20241117 added KeyupVarPrcnt AdvParser.cpp, to better recognize keyboard/paddle sent code */
/*20241119 added forced wordbreak based on shift in incoming tone frequency */
/*20241120 AdvParser.cpp- added new sloppy bug letter break test to rule set & changed DitIntrvlVal calc*/
/*20241124 Modified Night mode checkbox color & minor tweaks to AdvParser.cpp ruleset*/
/*20241209 more tweaks to AdvParser.cpp to mainly to improve sloppy bug (B3) fist decoding*/
/*20241212 more tweaks to AdvParser.cpp to improve quick timing set points */
/*20241214 more tweaks to AdvParser.cpp to improve BUG decoding */
/*20241221 Goertzelcpp - added dynamic adjustment/correction to squelch/threshold */
/*20241221 AdvParser.cpp - revised quick method for finding letter break value */
/*20241226 AdvParser.cpp - more refinements to letter break & word break code*/
/*20241229 More tweaks AdvParser.cpp & added clear RX text button to main screen */
/*20241229 DcodeCW.cpp - revised approach to setting word break wait interval via the WrdBrkFtcr*/
/*20241230 LVGLMsgBox.cpp - Added 'F7' shortcut to clear Decoded Text space/area*/
/*20250101 AdvParser.cpp - more refinements to letter break, splitPt, & word break code*/
/*20250107 Goertzelcpp - More tweaks to squelch/curNois/ToneThresHold to make it more responsive to changing signal conditions */
/*20250108 AdvParser.cpp - more refinements to letter break, & DitIntrvlVal code*/
/*20250110 Changed method of passing 'key' state from Goertzel to CW Decoder (DcodeCW.cpp), Now using a task & Queues*/
/*20250112 DcodeCW.cpp - Refined/Debugged Queue(s) management & building KeyDwn & KeyUp data sets related to AdvParser*/
/*20250114 main.cpp - reworked postparser delete count management code to improve overwrite/replacement */
/*20250115 Goertzelcpp - Tweaks to squelch/curNois/ToneThresHold to improve weak signal tone detection */
/*20250115 AdvParser.cpp - lowered 'starting point' seach for letter break */
/*20250116 DcodeCW.cpp - Reworked BldKeyUpDwnDataSet() and other areas related to 'wrdbrkFtcr', to improve 'slow' code decoding*/
/*20250117 DcodeCW.cpp - Added word break conditional test to BldKeyUpDwnDataSet()*/
/*20250119 AdvParser.cpp - added code to ensure last dataset entry is treated as a letterbreak*/
/*another  Goertzelcpp - tweak to ToneThresHold code, mainly intended, to improve ingnoring white noise*/
/*20250123 Goertzelcpp - reworked, yet again , how to manage tonedetect threshold level for both noisy & quiet conditions*/
/*20250126 Goertzelcpp - more tweaks to threshold setpoint code*/
/*20250203 Added code & queue to manage/display S/N log calc */
/*20250210 Added Automatic 'new line' when Sender change(i.e., tone frequency change +/-15Hz) is detected*/
/*20250211 reworked Sender changed & tone Frequency filter code*/
/*20250212 Created seperate task/process to freq Calc & detect sender change*/
/*20250213 DcodeCW.cpp - New code to manage display when 'sender' change has been detected*/
/*20250217 DcodeCW.cpp - Added wordbreak incrementing & Goertzelcpp - reduced sample buffering 6 to 3*/
/*20250221 DcodeCW.cpp - Reworked 'Space' insertion code*/
/*20250221 Reworked xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx) code, AdvParserTask() deletCnt & advparser.Msgbuf rebuild*/
/*20250225 LVGLMsgBox.cpp - now initializing 'lastWrdBrk' = 98, instead of =0 to stop display lockup in noisy environment*/
/*20250225 AdvParser.cpp - reworked 'wrdbrkFtcr' compesation code & reanbled updates from tha Adavance post past paser back to the real time decoder */
/*2025026 Goertzelcpp - added crude 'inactivity' check, to improve noise spike rejection*/
/*20250302 Rewrote interface between Goertzel & DcodeCW to pass all timing info via queues to reduce loading/ADC dma dropouts*/
/*20250303 Clean up work to Goertzel.cpp, DcodeCW.cpp, & AdvParser.cpp files*/
/*20250304 Goertzelcpp - Changed Avgnoise logic to ignore 'keydown' state change, improving noisy tone dection while still maintaining high noise immunity*/
/*20250306 reorganized task to core assignments to solve skipped adc data conversions*/
/*20250307 DcodeCW.cpp - Reworked wordbreak management */
/*20250310 DcodeCW.cpp - reworked ResetLstWrdDataSets(), & KeyEvntTask() to improve >35WPM decoding, and wordbreak management*/
/*20250321 UpDate Just to ensure Github & working project are Synced */
/*20250325 Added 'splash screen', which was kindly provided by Bill/WA4FAT. THANK YOU Bill*/
/*20250325 Added touch event kill to 'splash screen' */
/*20250326 Set splash screen 'hang time' to 8 seconds(see line 182) */
/*20250912 bt_keyboard.cpp - HID INPUT_EVENT; added code to support Microsoft style key data */
/*20250913 bt_keyboard.cpp - Added limited support for #Keypad; 0-9; +; ENTER; based on input from ZL1DRS */
/*20250913 LVGLMsgBox.cpp - Added new method/function NuLineDcdTA(void) and restored ClrDcdTA to origanal Clear Text function using 'F6'*/
/*20250916 Added keyboard controlled 'scroll' support for displays W/o 'touch' support*/
/*20250918 LVGLMsgBox.h - revised 'help' text*/
/*20250920 added'_lv_disp_refr_timer(NULL)' to settingsloop() to ensure the display gets 'refreshed' after loading the settings screen */
/*20250920 DcodeCW.cpp - commented out redundant xSemaphoreGive(DeCodeVal_mutex);*/
/*20250921 LVGLMsgBox.cpp - More tweeks to display refresh process*/
/*20250923 LVGLMsgBox.cpp - Updated Main Screen Buttons */
/*20250924 LVGLMsgBox.cpp - reworked Update_textarea() when 'capping the ta buffer to take in account character width & word breaks*/
/*20250925 LVGLMsgBox.cpp - added 'F10' shortcut to toggle between Day/Night mode*/
/*20250926 LVGLMsgBox.cpp - added 'F11' shortcut to toggle between Main & Settings screen*/
/*20250930 LVGLMsgBox.cpp - reworked 'Help' screen to improve readability*/
/*20251008 DcodeCW.cpp - Revised code to only insert a 'space' character when the single character word is made up of two or less Morse symbols*/
/*20251010 AdvParser.cpp - reworked BldKyUpBktTbl(void) to improve letter break detection for keyboard/paddle sent code*/
/*20251010 AdvParser.cpp - another small change improve letter break dection*/
/*20251025 Goertzel.cpp - moved to more streamlined method of calculating Goertzel algorithm*/
/*20251113 Goertzel.cpp - Simplified threshold tone detection code */
/*20251213 Revised paltformio.ini to be complaint with espidf (v5.5.0)*/
/*20251230 AdvParser.cpp - added check to skip very small keyup intervals in BldKyUpBktTbl(void) method 'P'addle letter break detection    */
/*20251231 AdvParser.cpp - changed stopchkval multiplier from 1.7 to 1.8 in BldKyUpBktTbl(void) method*/

