jmharvey1/ESP32S3_CW_Machine/src/main.cpp
#define USE_KYBrd 1
#include "sdkconfig.h" //added for timer support
#include "globals.h"
#include "main.h"
#if USE_KYBrd
#include "bt_keyboard.h"
#endif /* USE_KYBrd*/
#include <esp_log.h>
#include <iostream>
#include <math.h> // added this for iir support
#include "esp_system.h"
#include "esp_event.h"
#include "driver/gpio.h"
#include "rom/ets_sys.h"
#include "soc/soc_caps.h" // included just to have quick access view this file
///////////////////////////////
#include "esp_core_dump.h"
/*helper ADC files*/
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_adc/adc_continuous.h"
/*Project specific files*/
#include "Goertzel.h"
#include "DcodeCW.h"
#include "LVGLMsgBox.h"
#include "CWSndEngn.h"
/*BlueTooth*/

#include <string.h> // included to support call to 'memset()'
/*Uncomment to plot Raw ADC Samples*/
// #define POSTADC
/* the following defines were taken from "hal/adc_hal.h" 
 and are here for help in finding the true ADC sample rate based on a given declared sample frequency*/
#define ADC_LL_CLKM_DIV_NUM_DEFAULT       15
#define ADC_LL_CLKM_DIV_B_DEFAULT         1
#define ADC_LL_CLKM_DIV_A_DEFAULT         0
#define ADC_LL_DEFAULT_CONV_LIMIT_EN  6    0

#define TFT_GREY 0x5AEB // New colour

//TFT_eSPI tft = TFT_eSPI(); // Invoke TFT Display library
//////////////////////////////
/*timer interrupt support*/
#include "esp_timer.h"
esp_timer_handle_t DotClk_hndl;
// esp_timer_handle_t DsplTmr_hndl;
TimerHandle_t DisplayTmr;
/* END timer interrupt support          */

/*Debug & backtrace analysis*/
uint8_t global_var;
/*To make these variables available to other files/section of this App, Moved the following to main.h*/

DF_t DFault;
int DeBug = 1; // Debug factory default setting; 0 => Debug "OFF"; 1 => Debug "ON"
char StrdTxt[20] = {'\0'};
/*Factory Default Settings*/
//char RevDate[12] =  TODAY;//"20240608";
char MyCall[10] = "KW4KD";
char MemF2[80] = "VVV VVV TEST DE KW4KD";
char MemF3[80] = "CQ CQ CQ DE KW4KD KW4KD";
char MemF4[80] = "TU 73 ES GL";
char MemF5[80] = "RST 5NN";
char LogBuf[100];
esp_err_t ret;
char Title[120];
uint8_t SplashHangTime = 8; //the inteval, in seconds, that the splash screen persists
bool setupFlg = false;
bool ScopeFlg = false;
bool HelpFlg = false;
bool ScopeActive = false;
bool clrbuf = false;
bool PlotFlg = false;
bool UrTurn = true;
bool WokeFlg = false;
bool QuequeFulFlg = false;
bool mutexFLG =false; // used to manage SPI shared resource
bool adcON =false;
bool SkippDotClkISR = false;
bool ScopeArm = false;
bool ScopeTrigr = true;
bool NuSender = false;
uint8_t QueFullstate;
float BiasError = 0;
int Smplcnt = 0;
bool SmplSetDone = false;
volatile int CurHiWtrMrk = 0;
static const uint8_t state_que_len = 100;
static QueueHandle_t state_que;
static const int RxSig_que_len = 15;//50
QueueHandle_t RxSig_que;
static const int ToneSN_que_len = 25;//50
QueueHandle_t ToneSN_que;
QueueHandle_t ToneSN_que2;
static const int KeyEvnt_que_len = (16*IntrvlBufSize) -3;//50;
static const int KeyState_que_len = KeyEvnt_que_len;
QueueHandle_t KeyEvnt_que;
QueueHandle_t KeyState_que;
static const int ToneFrq_que_len = 10;//50
QueueHandle_t ToneFrq_que;
SemaphoreHandle_t IIR_Coef_mutx;
SemaphoreHandle_t mutex;
SemaphoreHandle_t DsplUpDt_AdvPrsrTsk_mutx;
SemaphoreHandle_t ADCread_disp_refr_timer_mutx;
bool Touch_mutex = true; //used to navigate touch I2C conflicts during BLE connection

/* the following 2 entries are for diagnostic capture of raw DMA ADC data*/
#ifdef POSTADC
int Smpl_buf[6 * Goertzel_SAMPLE_CNT];
int Smpl_Cntr = 0;
#endif

int MutexbsyCnt = 0;
unsigned long SmpIntrl = 0;
unsigned long LstNw = 0;
unsigned long EvntStart = 0;
unsigned long ToneStart = 0; // used to calc true adc samplerate
int cur_smpl_rate = 0;
float Grtzl_Gain = 1.0;
/*the following 4 lines are needed when you want to synthesize an input tone of known freq & Magnitude*/
// float LclToneAngle = 0;
// float synthFreq = 750;
// int dwelCnt = 0;
// float AnglInc = 2*PI*synthFreq/SAMPLING_RATE;

/*Global ADC variables */
// #define Goertzel_SAMPLE_CNT   384 // @750Hz tone input & 48Khz sample rate = 64 samples per cycle & 6 cycle sample duration. i.e. 8ms
// #define EXAMPLE_ADC_CONV_MODE           ADC_CONV_SINGLE_UNIT_1
// #define EXAMPLE_ADC_USE_OUTPUT_TYPE1    1
// #define EXAMPLE_ADC_OUTPUT_TYPE         ADC_DIGI_OUTPUT_FORMAT_TYPE1
static adc_channel_t channel[1] = { ADC_CHANNEL_5};//per waveshare example AD code, this is the channel i.e. GPIO6 pin to use 
adc_continuous_handle_t adc_handle = NULL;
TaskHandle_t GoertzelTaskHandle;
static TaskHandle_t DsplUpDtTaskHandle = NULL;
TaskHandle_t CWDecodeTaskHandle = NULL;
TaskHandle_t AdvParserTaskHandle = NULL;
TaskHandle_t KeyEvntTaskTaskHandle = NULL;
bool BlkDcdUpDts = false;
//static TaskHandle_t UpDtRxSigTaskHandle = NULL;
TaskHandle_t BLEscanTask_hndl = NULL;
TaskHandle_t HKdotclkHndl;
TaskHandle_t ToneFreqTaskHandle = NULL;

static const char *TAG1 = "ADC_Config";
static const char *TAG2 = "PAIR_EVT";
uint32_t ret_num = 0;
uint8_t result[Goertzel_SAMPLE_CNT * SOC_ADC_DIGI_RESULT_BYTES] = {0};
/*tone freq calc variables */
uint16_t SmplCNt = 0;
uint32_t NoTnCntr = 0;
uint8_t PeriodCntr = 0;
int Oldk = 0; //used in the addsmpl() as part of the auto-tune/freq measurement process 
int DemodFreq = (int)TARGET_FREQUENCYC;
int OutOfBndFrq = 0;
float CurSendrFreq = (float)DemodFreq;
int AvgToneFreq = DemodFreq;
//float intrglerr = 0.0;
uint8_t OutofBndCnt = 0;

bool TstNegFlg = false;
bool CalGtxlParamFlg = false;
////////////////////
/*iir BP Filter delay buckets*/
float in_z2, in_z1, out_z2, out_z1;
float in_z3, in_z4, out_z3, out_z4, out_z5;
/*iir BP Filter coefficients*/
float a0 = 0.08599609327133607;
float a1 = 0.0;
float a2 = -0.08599609327133607;
float b0 = 1.0;
float b1 = -1.309777513510262;
float b2 = 0.8280078134573279;
void Calc_IIR_BPFltrCoef(float Fc, float Fs, float Q); 
////////////////////
int curOwner =0; //used for debugging xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx)
LVGLMsgBox lvglmsgbx(StrdTxt);
//CWSNDENGN CWsndengn(&DotClk_hndl, &tft, &lvglmsgbx);
CWSNDENGN CWsndengn(&DotClk_hndl, &lvglmsgbx);
//lvglmsgbx->LinkCWSendEngn(&CWsndengn);
#if USE_KYBrd
BTKeyboard bt_keyboard(&lvglmsgbx, &DFault);
#endif /* USE_KYBrd*/
/*                           */
//BTKeyboard bt_keyboard(&lvglmsgbx, &DFault);
//TxtNtryBox txtntrybox(&DotClk_hndl);
/* coredump crash test code */
/* typedef struct{
  int a;
  char *s;
} data_t;

void show_data(data_t *data){
  if(strlen(data->s) >10){
    printf("String too long");
    return;
  }
  printf("here's your string %s", data->s);
} */

/*ADC callback event; Fires when ADC buffer is full & ready for processing*/
bool IRAM_ATTR s_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
{
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  // Notify GoertzelTaskHandle that the buffer is full.

