jmharvey1/ESP32S3_CW_Machine/src/main.cpp
    *pCntrA += 1;
  }
  
  if ((*pCntrA == (6 * Goertzel_SAMPLE_CNT)) || !UrTurn)
  {
    UrTurn = false;
    *pCntrA = 0;
    vTaskResume(CWDecodeTaskHandle);
    // Smpl_buf[*pCntrA] = 2000; // place a marker at the the begining of the next set
  }
#endif
  /* END code for diagnostic testing; graph raw ADC samples*/
}

/////////////////////////////////////////////
/* Goertzel Task; Process ADC buffer*/
void GoertzelHandler(void *param)
{
// #ifdef POSTADC  
//   char Smpl[10];
// #endif  
  static uint32_t thread_notification;
  static const char *TAG2 = "ADC_Read";
  // uint16_t curclr = 0;
  // uint16_t oldclr = 0;
  int curclr = 0; // modified to support lvgl based display
  int oldclr = 0; // modified to support lvgl based display
  int pksig = 0;
  int k;
  int offset = 0;
  int OLDltrCmplt;
  bool restore = false;
  /*for Waveshare/ESP32s3 & based on 11 bit ADC output; Set bias to 1024*/
  int BIAS = 1800; // 1844+150; // based reading found when no signal applied to ESP32Cw_Machine_ADC_init
  int Smpl_CntrA = 0;
  bool FrstPass = true;
  int pksigH = 0;
  int sigSmplCnt = 0;
  unsigned long LstNowTime = 0;
  // bool updt = false;
  InitGoertzel(); // make sure the Goertzel Params are setup & ready to go
  /*The following is just for time/clock testing/veification */
  // unsigned long GrtzlStart = pdTICKS_TO_MS(xTaskGetTickCount());
  // unsigned long GrtzlDone = pdTICKS_TO_MS(xTaskGetTickCount());
  bool skip1;
  while (1)
  {
    skip1 = false;
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */

    thread_notification = ulTaskNotifyTake(pdTRUE,
                                           portMAX_DELAY);

    if (thread_notification)
    { // Goertzel data samples ready for processing
      unsigned long Now = EvntStart; //pdTICKS_TO_MS(xTaskGetTickCount());
      if(Now - LstNowTime >5)
      {
        if(!restore) OLDltrCmplt = ltrCmplt;
        restore = true;
        ltrCmplt = -15000;//printf("%d\t%d\n", (int)Now, (int)LstNowTime );
#ifdef SpclTst        
        printf("GAPP/SKIP interval %d\n", (int)(Now - LstNowTime));
#endif
      } else if (restore)
      {
        restore = false;
        ltrCmplt = OLDltrCmplt;
      }
      LstNowTime = Now;
      if(SmplSetDone){
        BIAS = BIAS + BiasError;
        bias_int = BIAS;
        //printf("BIAS: %d; error: %f\n", BIAS, BiasError);
        BiasError = 0;
        SmplSetDone = false;
        
      }
      

      /*the following 2 flags were added for LVGL support to manage the use of
      the 'ADCread_disp_refr_timer_mutx' Semaphore*/
      bool rdy = false;
      bool relseSemphr = false;
      ret = adc_continuous_read(adc_handle, result, Goertzel_SAMPLE_CNT * SOC_ADC_DIGI_RESULT_BYTES, &ret_num, 0);
      if (ret == ESP_OK)
      {
        if (SlwFlg) // if in 'slow' mode (i.e., 4ms sample interval with 8ms dataset) no longer being used 20251025
          FrstPass = false; // 20231231 added to support new 4ms sample interval, W/ 8ms dataset
        if (FrstPass)
        {
          ResetGoertzel();
        }
        if (SlwFlg && !FrstPass) //'slow' mode (i.e., 4ms sample interval with 8ms dataset) no longer being used 20251025
          offset = Goertzel_SAMPLE_CNT;
        else
          offset = 0;

        /*  ESP_LOGI("TASK_ADC", "ret is %x, ret_num is %"PRIu32" bytes", ret, ret_num);*/
        if (CWsndengn.IsActv() && CWsndengn.GetSOTflg())
        {
          // if (xSemaphoreTake(ADCread_disp_refr_timer_mutx, pdMS_TO_TICKS(3)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
          // {
            rdy = true;
          //   relseSemphr = true;
          // }
        }
        else
          rdy = true;
        if (rdy)
        {
          for (int i = 0; i < ret_num /(SOC_ADC_DIGI_RESULT_BYTES); i++) // for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES)
          {
            /*Used this approach because I found the ADC data were being returned in alternating order.
            So by taking them a pair at a time,I could restore (& process them) in their true chronological order
            BUT for the Sharewave ESP32S3, it appears that the data sample pairs don't need to be reversed*/
            int pos0 = i;
            // int pos0 = 2 * i;
            // int pos1 = pos0 + 1;
            adc_digi_output_data_t *p0 = (adc_digi_output_data_t *)&result[pos0 * SOC_ADC_DIGI_RESULT_BYTES];
            //adc_digi_output_data_t *p1 = (adc_digi_output_data_t *)&result[pos1 * SOC_ADC_DIGI_RESULT_BYTES];
            k = ((int)(p0->type2.data) - BIAS);     // for esp32s3 changed from type1 to type2 & samples are added in 'normal' order
            addSmpl(k, pos0 + offset, &Smpl_CntrA); // addSmpl(k, pos1, &Smpl_CntrA);
            // k = ((int)(p1->type2.data) - BIAS);     // for esp32s3 changed from type1 to type2 & samples are added in 'normal' order
            // addSmpl(k, pos1 + offset, &Smpl_CntrA); // addSmpl(k, pos0, &Smpl_CntrA);
          }
        }
        /* We have finished accessing the shared resource.  Release the
             semaphore. */
        // if (relseSemphr)
        //   xSemaphoreGive(ADCread_disp_refr_timer_mutx);

#ifdef POSTADC
        skip1 = true;
        if (!skip1)
        {
#endif          
          /*logic to manage the number of data samples to take before going on to compute goertzel magnitudes*/
          if (SlwFlg && FrstPass)//'slow' mode (i.e., 4ms sample interval with 8ms dataset) no longer being used 20251025
          {
            FrstPass = false;
          }
          else
          {
            FrstPass = true;
          }

          if (!CWsndengn.IsActv() || !CWsndengn.GetSOTflg())
          {
            if (FrstPass)
              ComputeMags(EvntStart); //"EvntStart" is the time stamp for this dataset
            curclr = ToneClr();       // Returns Sig level as calculated by Goetzel.cpp
            // printf("curclr: %d\n", curclr);
          } // else printf("%d\n", CWsndengn.GetState());//just for diagnostic testing
          /*The following is just for time/clock testing/veification */
          // unsigned long sampleIntrvl = Now - ToneStart;
          // ToneStart = Now;
          // cur_smpl_rate = ((ret_num) * 250) / sampleIntrvl;
#ifdef POSTADC        
        }// end if(!skip)
        //vTaskDelay(pdMS_TO_TICKS(10));
#endif
      }
      else if (ret == ESP_ERR_TIMEOUT)
      {
        // We try to read `ADC SAMPLEs/DATA` until API returns timeout, which means there's no available data
        /*JMH - This ocassionally happens; Why I'm not sure; But seems to recover & goes on with little fuss*/
        ESP_LOGI(TAG2, "BREAK from GoertzelHandler TASK");
        // break; //Commented out for esp32 decoder task
      }
      else
      {
        ESP_LOGI(TAG2, "NO ADC Data Returned");
      }

    } // end if(thread_notification)
  } // end while(1) loop
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  vTaskDelete(NULL);
}
///////////////////////////////////////////////////////////////////////////////////
/* DisplayUpDt Task; 
Collects data from events that happened in the last 33 ms & initiates a
Display update */
void DisplayUpDt(void *param)
{
  static uint32_t thread_notification;
  uint8_t state;
  // int QueueEmptyCnt = 0;
  int RxSig = 0;
  int CurSig = 0;
  while (1)
  {
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */
    if (QuequeFulFlg) printf("DisplayUpDt() TASK ERROR\n");
    thread_notification = ulTaskNotifyTake(pdTRUE,  pdMS_TO_TICKS(100)); //portMAX_DELAY
    if (thread_notification)
    {
      if (QuequeFulFlg) printf("DisplayUpDt()/thread_notification TASK ERROR\n");
      // if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE) // wait forever
      // {
      //   xSemaphoreGive(mutex);
      //   mutexFLG = false;
      // }
      // if (mutexFLG)
      int lpcnt = 0;
      while(mutexFLG){
        lpcnt++;
        
