jmharvey1/ESP32S3_CW_Machine/src/main.cpp
        vTaskDelay(pdMS_TO_TICKS(6));
      }
      if(lpcnt > 0) printf("%d. ERROR timer driven DisplayUpDt out of Sync\n", lpcnt);
      // if (mutex != NULL)
      // {
      /* See if we can obtain the semaphore.  If the semaphore is not
      available wait 10 ticks to see if it becomes free.
      note:  The macro pdMS_TO_TICKS() converts milliseconds to ticks */
      // bool tryagn = true;
      // while (tryagn)
      // {
      /*TODO verify that for LVGL (ShareWave Display) that this is needed;
      Don't think it is, since Sharewave is NOT a SPI based display*/
      // if (xSemaphoreTake(mutex, pdMS_TO_TICKS(100)) == pdTRUE)
      // {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      if (CWsndengn.UpDtWPM)
      {
        CWsndengn.UpDtWPM = false;
        CWsndengn.RefreshWPM();
      }
      RxSig = 0;
      int cnt = 0;
      bool readQueue = true;
      //sprintf(LogBuf,"DisplayUpDt Step 1 complete\n");
      /* get latest goertzel tone magnitude */
      while (readQueue)
      {
        readQueue = (xQueueReceive(RxSig_que, (void *)&CurSig, pdMS_TO_TICKS(3)) == pdTRUE);
        if (readQueue)
        {
          RxSig = CurSig;
          // printf("RxSig %d\n", RxSig);
        }

        // cnt++;
      }
      
      //sprintf(LogBuf,"DisplayUpDt Step 2 complete\n");
      /*make sure AdvanceParserTask isn't active before preceeding*/
      if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, pdMS_TO_TICKS(15)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
      {
        curOwner =2;
        bool lpagn = true;
        while (lpagn) //(TickType_t)10
        {
          if (xQueueReceive(state_que, (void *)&state, pdMS_TO_TICKS(10)) == pdTRUE)
          {
            lvglmsgbx.IntrCrsr(state);
            //printf("state %d\n", state);
          }
          else
          {
           lpagn = false;
          }
        }
        QuequeFulFlg = false;
        lvglmsgbx.Str_KyBrdBat_level(bt_keyboard.get_battery_level());
        //sprintf(LogBuf,"DisplayUpDt Step 3 complete\n");
        /*update tone bar graph*/
        lvglmsgbx.dispMsg2(RxSig);
        //sprintf(LogBuf,"DisplayUpDt Step 4 complete\n");
        /* We have finished accessing the shared resource.  Release the
        semaphore. */
        xSemaphoreGive(DsplUpDt_AdvPrsrTsk_mutx);
      } else printf("xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx FAILED; cur Owner:%d\n", curOwner); 
      
      //printf("Cur ADC Sample Rate: %d\n", cur_smpl_rate);// just for diagnostic testing
      // bool HeapOK = heap_caps_check_integrity_all(true);
      // if(!HeapOK)
      // {
      //   printf("Heap ISSUE\n");
      // }
    } // END if (thread_notification)
  } // end while(1) loop
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  printf("ERROR DisplayUpDt task DELETED\n");
  vTaskDelete(NULL);
}
///////////////////////////////////////////////////////////////////////////////////////
/*
* Convert accumulated sample count needed to produce 40 'zero crossings' (tone cyles) to frequency,
* and second, look for tone frequency change, indicating a change in 'sender'
*/
void ToneFreqTask(void *param)
{
  //uint8_t PeriodCntr;
  uint16_t _SmplCNt = 1;
  int _DemodFreq =0;
  while (1)
  {
    bool readQueue = true;
    while (readQueue)
    {
      readQueue = (xQueueReceive(ToneFrq_que, (void *)&_SmplCNt, pdMS_TO_TICKS(3)) == pdTRUE);
      if (readQueue)
      {
        _DemodFreq = (int)((float)40 * (float)SAMPLING_RATE) / (float)_SmplCNt;
        freq_int = _DemodFreq;// used in the scope view as current tone frequency
        if (_DemodFreq >= 450)
        {
          // printf("_DemodFreq: %d;\tAvgToneFreq: %d\tTARGET_FREQUENCYC: %d;\tCurSendrFreq: %d\n", _DemodFreq, (uint16_t)AvgToneFreq, (uint16_t)TARGET_FREQUENCYC, (int)CurSendrFreq);
          /*20250211 reworked Sender changed & tone Frequency filter code*/
          if (abs(_DemodFreq - AvgToneFreq) < 3)
          {
            /*OK we got essentially the same freq twice in row, so it must be valid*/
            CalGtxlParamFlg = true;
            if (xSemaphoreTake(IIR_Coef_mutx, pdMS_TO_TICKS(3)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
            {
              Calc_IIR_BPFltrCoef((float)AvgToneFreq, SAMPLING_RATE, 5.0); //3.7071
              xSemaphoreGive(IIR_Coef_mutx);
            }
          }
          else
          {
            AvgToneFreq = (int)((1 + (4 * AvgToneFreq + _DemodFreq) / 5));
          }
          /*Now test/check for sender change based on '_DemodFreq' freq change */
          if ((abs((int)CurSendrFreq - _DemodFreq) >= 7))
          {
            /*Check verify that new _DemodFreq value for consistentcy*/
            if (OutofBndCnt == 0)
            {
              OutOfBndFrq = _DemodFreq;
              OutofBndCnt++;
            }
            else if ((abs(OutOfBndFrq - _DemodFreq) > 5)) //20250218  > 4
            { /*OutOfBndFrq reset*/
              OutOfBndFrq = _DemodFreq;
              OutofBndCnt = 0;
            }
            else if ((abs(OutOfBndFrq - _DemodFreq) <= 5))
            {
              OutofBndCnt++;
            }
            // printf("_DemodFreq: %d;\tOutOfBndFrq: %d;\tCurSendrFreq: %d\tOutofBndCnt: %d\n", _DemodFreq, OutOfBndFrq, (uint16_t)CurSendrFreq, OutofBndCnt);

            if (OutofBndCnt >= 4)
            {
              OutofBndCnt = 0;
              CurSendrFreq = (float)_DemodFreq;
              /*if here, we just had a shift in the incoming tone of more than 15hz,
              so assume new 'sender', & force a wordbreak in the decoded text
              by setting the expected wordbreak time to 0 */
              NuSender = true;
              // printf("\t Nu Sender; CurSendrFreq: %d\n", (int)CurSendrFreq);
            }
          }
          else
          {
            OutofBndCnt = 0;
            CurSendrFreq = (19*CurSendrFreq + _DemodFreq)/20;
            // printf("_DemodFreq: %d;\tOutOfBndFrq: %d;\tCurSendrFreq: %6.1f\tOutofBndCnt: %d\n", _DemodFreq, OutOfBndFrq, CurSendrFreq, OutofBndCnt);
          }
          
          // float tempval = ((float)AvgToneFreq - CurSendrFreq) / 50;
          // if (tempval > 0.1)
          //   tempval = 0.1;
          // if (tempval < -0.2)
          //   tempval = -0.2;
          // CurSendrFreq = CurSendrFreq + tempval;
        } // end if (_DemodFreq > 450)
      }
    }

    vTaskSuspend(ToneFreqTaskHandle);

