jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  } // end while(1) loop
  vTaskDelete(NULL);
}
//////////////////////////////////////////////////////////////////////////////////////
/* CW Decoder Task; CW decoder main loop*/
void CWDecodeTask(void *param)
{
  static uint32_t thread_notification;
  static const char *TAG3 = "Decode Task";
  char Smpl[10];
  int sample;
  StartDecoder(&lvglmsgbx);
  while (1)
  {
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */

    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (thread_notification)
    {
      //printf("CWDecodeTask CoreID: %d\n", xPortGetCoreID());
#ifndef POSTADC      
      Dcodeloop();
      vTaskDelay(pdMS_TO_TICKS(2)); //this task under normal conditions runs all the time So insert a breather to allow Watchdog to reset
      //printf("CWDecodeTask complete\n");
#endif      
      /* uncomment for diagnostic testing; graph ADC samples; Note: companion code in addSmpl(int k, int i, int *pCntrA) needs to be uncommented too */
      /* Pull accumulated "ADC sample" values from buffer & print to serial port*/
#ifdef POSTADC
      if (!UrTurn)
      {
        /*
        uint32_t freq = 120*1000;//48*1000;
        uint32_t interval = APB_CLK_FREQ / (ADC_LL_CLKM_DIV_NUM_DEFAULT + ADC_LL_CLKM_DIV_A_DEFAULT / ADC_LL_CLKM_DIV_B_DEFAULT+1) /4 / freq;
        uint32_t Smpl_rate = 1000000/interval;
        char buf[40];
        sprintf(buf, "interval: %d; SmplRate: %d\n", (int)interval, (int)Smpl_rate);
        printf(buf);
        */
        int pauscntr = 0;
        int smplftr = 80;
        if (bt_keyboard.PairFlg)
        {
          int stop = (6 * Goertzel_SAMPLE_CNT) / smplftr;
          for (int Raw_ADC_Smpl_ptr = 0; Raw_ADC_Smpl_ptr< stop; Raw_ADC_Smpl_ptr++)
          {
            int ptr = smplftr * Raw_ADC_Smpl_ptr;
            int val = Smpl_buf[ptr];

            // sprintf(Smpl, "%d.\t%d\n",ptr, val);
            sprintf(Smpl, "%d\n", val);
            printf(Smpl);
            pauscntr++;
            if (pauscntr == 250) // this prevents watchdog timer error/crash
            {
              pauscntr = 0;
              vTaskDelay(1);
            }
          }
        }
        UrTurn = true;
      }
      
      //vTaskDelay(pdMS_TO_TICKS(25));
      vTaskSuspend(NULL);
#endif /* POSTADC */     
      /* END code for diagnostic testing; graph ADC samples; */
      
      xTaskNotifyGive(CWDecodeTaskHandle);
      
    }
    else if (ret == ESP_ERR_TIMEOUT)
    {
      ESP_LOGI(TAG3, "BREAK from CWDecodeTask TASK");
      break;
    }
    if(WokeFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      WokeFlg = false;
      printf("!!WOKE!!\n");
    }
    if(QuequeFulFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      //QuequeFulFlg = false;
      char buf[40];
      sprintf(buf, "!!state QUEUE FULL!! %d\n", (int)QueFullstate);
      //printf(buf);
    }
  }
}
/*look for 'advertising' BLE keyboards
note: task remains active until one is found & 'paired'('PairFlg' is set to true)*/
void BLE_scan_tsk(void *param)
{
  const char *TAG2 = "BLE_scan_tsk";
  const char *TAG2A = "\nBLE_scan_tsk";
  //esp_log_level_set("*", ESP_LOG_DEBUG);
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  bool loop = true;
  SkippDotClkISR = true;
  while (loop)
  {
    bt_keyboard.PairFlg = false;
    ESP_LOGI(TAG2, "BLE SCAN - START");
    uint32_t EvntStart = pdTICKS_TO_MS(xTaskGetTickCount());
    uint16_t dev_scan_intrvl = 0;
    bt_keyboard.devices_scan(2); // Required to discover new keyboards and for pairing
                                 // Default duration is 3 seconds
    //while(dev_scan_intrvl<2000)
    //{
    //  dev_scan_intrvl = (uint16_t)(pdTICKS_TO_MS(xTaskGetTickCount()) - EvntStart);
    //}
    //ESP_LOGI(TAG2, "BLE SCAN - DONE (interval: %d)", dev_scan_intrvl);
    ESP_LOGI(TAG2, "BLE SCAN - DONE\n\n");
    if (bt_keyboard.GetPairFlg1())
    { 
      bt_keyboard.PairFlg = true;
      /*Clear/Erase Keyboard text area*/
      if (!DFault.DeBug)
      {
        Title[0] = 0xFF;
        Title[1] = 0x0;
        lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE); // clear send keyboard text area
      }
      sprintf(Title, "\n");
      lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
      vTaskDelay(pdMS_TO_TICKS(100));
      sprintf(Title, "KEYBOARD READY\n");
      lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
      ESP_LOGI(TAG2, "Pairing Complete; KEYBOARD READY");
    }
    if (bt_keyboard.PairFlg)
    {
      //printf("EXIT SCAN\n");
      ESP_LOGI(TAG2, "EXIT SCAN");
      loop = false;
      // vTaskSuspend(NULL); // NULL = suspend this task
    }
  } // end while(loop)
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  SkippDotClkISR = false;
  vTaskDelete(NULL);
}

///////////////////////////////////////////////////////////////////////////////////
/* AdvParserTask Task; Post Parser Code execution
*  Note: this task runs on core 1 
*/
void AdvParserTask(void *param)
{
  // static uint32_t thread_notification;// not used in AdvParserTask
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  // #define SpclTst
  while (1)
  {
    /* Sleep until instructed to resume from DcodeCW.cpp */
    // printf("AdvParserTask Launched\n"); //added to verify task management

    BlkDcdUpDts = true;
    /*start Post parser by evaluating the current datasets*/
    advparser.EvalTimeData();
    /*At this point the the post parser completed the evaluation & constructed its version of the last word 
    decoded by the realtime decoder process*/
    /*Now compare Advparser decoded text to original text; If not the same,
    replace displayed with Advparser version*/
    bool same = true;
    bool Tst4Match = true;
    int i;
    int FmtchPtr; // now only used for debugging
    /*start Scan/compare last word displayed w/ advpaser's version*/
    int NuMsgLen = advparser.GetMsgLen();
    int LtrPtr = advparser.LtrPtr; // length of last word displayed
    if (NuMsgLen > LtrPtr || NuMsgLen < LtrPtr) // easy test
    { // if the advparser test string is longer, then delete the last word printed
      same = false;
      i = LtrPtr;
    }
    else
    { /*1st test didn't show a difference. So test character by character*/
      for (i = 0; i < LtrPtr; i++)
      {
        if (advparser.Msgbuf[i] == 0)
        {
          Tst4Match = false;
          break;
        }
        if ((advparser.LtrHoldr[i] != advparser.Msgbuf[i]) && Tst4Match)
        {
          FmtchPtr = i; // now only used for debugging
          same = false;
        }
      }
    }

