jmharvey1/ESP32S3_CW_Machine/src/main.cpp
    /*If they don't match (same = false), replace displayed text with AdvParser's version*/
    int deletCnt = LtrPtr; // 0; // moved to here to support lvgl debugging
    int bufcharcnt = 0;
    char ringbuf[6];
    char spacemarker = 'Y';
    uint8_t LstChr = lvglmsgbx.GetLastChar();
    uint8_t OldLstChr;
    char *LastChrSpaceStr[2] = {"False", "True"};
    if(!same)
    {
      
      /*need to block display update task during this 'if()' code */
      if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, portMAX_DELAY) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
      {
        
        //if(lvglmsgbx.LastChrSpace) deletCnt++; //increment, because the DcodeCW chkChrCmplt() just appended a space before launching the AdvParserTask
        deletCnt++; //increment, because the DcodeCW chkChrCmplt() just appended a space before launching the AdvParserTask

        curOwner = 1;
        bool abort = false;
#ifdef DeBgQueue
        printf("advparser.Msgbuf;'%s'; GetLastChar('%c') \n", advparser.Msgbuf, (char)LstChr);
#endif
        OldLstChr = LstChr;
        /*Configure DCodeCW.cpp to erase/delete original text*/
        /*Add word break space to post parsed text*/
        // char RingBufTst = 'T';
        /*returns true if the 2 buffer pointers are the same*/
        ringbuf[0] = ringbuf[1] = ringbuf[2] = ringbuf[3] = 0;
        int oldPtr = advparser.RingbufPntr1;
        if (!lvglmsgbx.TestRingBufPtrs(oldPtr))
        {
          bufcharcnt = lvglmsgbx.XferRingbuf(ringbuf, oldPtr);
          // RingBufTst = 'F';
          //deletCnt += bufcharcnt;//don't need to add this because what ever is here hasn't made it to the display
#ifdef AutoCorrect
          printf(" bufcharcnt:%d; ringbuf:'%s' \n", bufcharcnt, ringbuf);
#endif
        }
#ifdef AutoCorrect        
        else
        {
          printf("NO RingBuffer Conflict' \n");
        }
#endif        
        // while(bufcharcnt == 0)
        // {
        //   int oldPtr = advparser.RingbufPntr1;
        //   if (!lvglmsgbx.TestRingBufPtrs(oldPtr))
        //   {
        //     bufcharcnt = lvglmsgbx.XferRingbuf(ringbuf, oldPtr);
        //     RingBufTst = 'F';
        //     #ifdef AutoCorrect
        //     printf(" bufcharcnt:%d; ringbuf:'%s' \n", bufcharcnt, ringbuf);
        //     #endif
        //   }
        //   if (bufcharcnt == 0)
        //     vTaskDelay(pdMS_TO_TICKS(25));
        // }
        LstChr = lvglmsgbx.GetLastChar();
#ifdef AutoCorrect
        if (LstChr != OldLstChr)
          printf("!!! LstChr:'%c' != OldLstChr:'%c'\n", LstChr, OldLstChr);
#endif
        // advparser.Msgbuf[NuMsgLen] = 0x20; // 0x5f;//0x20;
        // advparser.Msgbuf[NuMsgLen + 1] = 0x0;
        char tmpbuf[34];
        // int OlddeletCnt = deletCnt;
        // if (deletCnt > 0)
        // {
        //   /*20250113 new method to find final/actual delete count*/
        //   if (bufcharcnt > 1)
        //     deletCnt++;
        //   if (bufcharcnt == 1 && (LstChr != OldLstChr))
        //     deletCnt++;
        //   /*End new find delete count method*/
        if (deletCnt > 0)
        {  
          char DelStr[30];
          if (deletCnt > 29)
          {
            abort = true;
            deletCnt = 29;
            printf("\n deletCnt capped @ 29\n");
          }
          if (!abort)
          {
            for (int i = 0; i < deletCnt; i++)
            {
              DelStr[i] = 0x8;
            }
            DelStr[deletCnt] = 0x0;
            /*Now copy the new advparser character string/set to a temp buffer 'tmpbuf'*/
            int ptr = 0;
            while (advparser.Msgbuf[ptr] != 0 && ptr < 28)
            {
              tmpbuf[ptr] = advparser.Msgbuf[ptr];
              ptr++;
            }
            tmpbuf[ptr] = 0;
            /*reassemble 'Msgbuf' with new adparser character set prefixed with the number of deletes
             needed to remove the original text.
             Due to RTOS Variances in process sequencing/timing, there can be 3 different states in the Decoded text area
             ringbuffer the following 'if' code addresses each of the 3 cases
            */
            // printf("**** '%s'->'%s'; deletCnt:%d; LtrPtr:%d; NuMsgLen:%d; LstChr:'%c'; LastChrSpace: %s \n", advparser.LtrHoldr, advparser.Msgbuf, deletCnt, LtrPtr, NuMsgLen, (char)LstChr, LastChrSpaceStr[(int)lvglmsgbx.LastChrSpace]);
            if (bufcharcnt >0 && ringbuf[0] != ' ')
              sprintf(advparser.Msgbuf, "%s%s %s", DelStr, tmpbuf, ringbuf); // AdvParser running behind schedule
            else if (bufcharcnt >0 && ringbuf[0] == ' ')
              sprintf(advparser.Msgbuf, "%s%s%s ", DelStr, tmpbuf, ringbuf); // AdvParser running faster than expected
            else
              sprintf(advparser.Msgbuf, "%s%s ", DelStr, tmpbuf); // normal/expected case
            /*for test/debug, show/print the before & after results*/
            // printf("old txt:%s;  new txt:%s\n\tdelete cnt: %d; advparser.LtrPtr %d; new txt length: %d; bufcharcnt: %d; ringbuf: %c%s%c; Space Corrected = %c(%d/%c%c%C) \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, ptr, bufcharcnt, '"', ringbuf, '"', spacemarker, LstChr, '"', LstChr, '"');
          }
          
        
        }
        if (!abort)
        {
          if (advparser.Dbug)
            printf("old txt %s; new txt %s; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
#ifdef AutoCorrect
          printf("old txt %s; new txt %s; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
#endif
#ifdef SpclTst
          printf("old txt '%s'; new txt '%s'; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
#endif
          // printf("old txt %s; new txt %s; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
          CptrTxt = false;
          lvglmsgbx.dispDeCdrTxt(advparser.Msgbuf, TFT_GREEN); // Added for lvgl; Note: color value is meaningless
          CptrTxt = true;
          // dletechar = oldDltState;
          /*now should be safe resume displayupdate task*/
        }
        xSemaphoreGive(DsplUpDt_AdvPrsrTsk_mutx);
      } else printf("xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx FAILED; cur Owner:%d\n", curOwner);
      /*assuming the Adv parser did a better job of decoding sync the real time decoder to the Adv parser timing values/WPM*/
      SyncAdvPrsrWPM();
      if(advparser.WrdBrkAdjFlg)
      {
        float _wrdbrkFtcr = wrdbrkFtcr;
        uint16_t _wordBrk = (uint16_t)wordBrk;
        wrdbrkFtcr = advparser.Get_wrdbrkFtcr();
        ApplyWrdFctr(wrdbrkFtcr);
        if (DbgWrdBrkFtcr) printf("main.cpp AdvParserTask update wordBrk+: %d; wrdbrkFtcr: %5.3f; OldwrdbrkFtcr: %5.3f; oldwordBrk: %d\n", (uint16_t)wordBrk, wrdbrkFtcr, _wrdbrkFtcr, _wordBrk);
      } 
      // printf("old txt:%s;  new txt:%s; delete cnt: %d; advparser.LtrPtr: %d ; new txt length: %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, advparser.Msgbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
    } //else printf("^^^^ '%s'->'%s'; deletCnt:%d; LtrPtr:%d; NuMsgLen:%d; LstChr:'%c'; LastChrSpace: %s \n", advparser.LtrHoldr, advparser.Msgbuf, deletCnt, LtrPtr, NuMsgLen, (char)LstChr, LastChrSpaceStr[(int)lvglmsgbx.LastChrSpace]);
#ifdef AutoCorrect
    else printf("old txt:'%s'\n", advparser.LtrHoldr);
#endif
#ifdef SpclTst
    else printf("old txt:'%s'\n", advparser.LtrHoldr);
#endif
    if (advparser.Dbug)
      printf("%s\n", advparser.LtrHoldr);

