jmharvey1/ESP32S3_CW_Machine/src/main.cpp
    BlkDcdUpDts = false;
    // erase contents of LtrHoldr & reset its index pointer (LtrPtr)
    for (int i = 0; i < LtrPtr; i++)
      advparser.LtrHoldr[i] = 0;
    if (advparser.Dbug)
      printf("--------\n\n");

    if(advparser.AvgDahVal < 100 )
    { // Advanced Parser indicates this is Hi-Speed CW 
      // Make sure Goertzel.cpp (tone detection )is aligned to follow keying
      avgDit = 1200 / 40; 

    }
    
    /*The following code is primarilry for debugging stack alocation & understanding how much time the advance parser needs*/
    // uint16_t AdvPIntrvl = (uint16_t)(pdTICKS_TO_MS(xTaskGetTickCount())-AdvPStart);
    // printf("AdvPIntrvl: %d\n", AdvPIntrvl);
    // uxHighWaterMark = uxTaskGetStackHighWaterMark( NULL );
    // printf("AdvParserTask stack: %d\n", (int)uxHighWaterMark);
    // printf("AdvParserTask CoreID: %d\n", xPortGetCoreID());
    // printf("Done\n");
    /* Sleep until instructed to resume from DcodeCW.cpp */
    // printf("AdvParser Task Done\n"); //added to verify task management
    vTaskSuspend(AdvParserTaskHandle);

  } // end while(1) loop
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  vTaskDelete(NULL);
}

///////////////////////////////////////////////////////////////////////////////////

extern "C"
{
  void app_main();
}
/*Template for keyboard entry handler function detailed futrther down in this file*/
void ProcsKeyEntry(uint8_t keyVal);
/*Settings screen keybrd entry loop*/
void SettingsLoop(void);
/*Scope screen keybrd entry loop*/
void ScopeLoop(void);
void HelpLoop(void);
/*        Display Update timer ISR Template        */
void DsplTmr_callback(TimerHandle_t xtimer);
/*        DotClk timer ISR Template                */
void IRAM_ATTR DotClk_ISR(void *arg);

#if USE_KYBrd
void pairing_handler(uint32_t pid)
{
  sprintf(Title, "Please enter the following pairing code:\n");
  lvglmsgbx.dispDeCdrTxt(Title, TFT_WHITE);
  /*take the pin # and parse it into a string of 2 digit number groups separated by a space*/
  char rawpinstr[10];
  char Prsdpin_str[10];
  // for (int i = 0; i < 10; i++)
  // {
  //   rawpinstr[i] = 0;
  //   Prsdpin_str[i] =0 ;
  // }
  sprintf(rawpinstr, "%6d", (int)pid);//convert pin from interger to text
  for (int i = 0; i < 3; i++)
  {
    int grpptr = 3 * i;
    int rawptr = 2 * i;
    Prsdpin_str[grpptr] = rawpinstr[rawptr];
    if (rawpinstr[rawptr + 1] != 0)
    {
      Prsdpin_str[grpptr + 1] = rawpinstr[rawptr + 1];
      Prsdpin_str[grpptr + 2] = ' ';
    }
    else
      Prsdpin_str[grpptr + 1] = rawpinstr[rawptr + 1];
    Prsdpin_str[grpptr + 3] = 0; //make sure the current string is NULL terminated 
  }
  sprintf(Title, "     %s\n", Prsdpin_str);
  lvglmsgbx.dispDeCdrTxt(Title, TFT_BLUE);
  sprintf(Title, "followed with ENTER on your keyboard: \n\n");
  lvglmsgbx.dispDeCdrTxt(Title, TFT_WHITE);
  //bt_keyboard.PairFlg = true;
  vTaskDelay(100 / portTICK_PERIOD_MS);
  //bt_keyboard.PairFlg = bt_keyboard.GetPairFlg1();
}
#endif /* USE_KYBrd*/

/**
 * @brief Main application entry point for ESP32S3 CW Machine.
 *
 * This function initializes hardware and software components, sets up tasks, timers, and queues,
 * and manages the main event loop for the CW Machine application. It handles display initialization,
 * BLE keyboard pairing, ADC configuration, and task management for CW decoding, tone frequency analysis,
 * and display updates. User settings are loaded from NVS (non-volatile storage) or factory defaults if not found.
 * The main loop manages splash screen display, transitions to settings, scope, and help screens, and processes
 * keyboard events including Bluetooth pairing and ADC control.
 *
 * Major steps:
 * - Set log level and configure GPIO for CW key output.
 * - Create FreeRTOS queues and mutexes for inter-task communication and synchronization.
 * - Initialize IIR filter coefficients and create tasks for display, parser, key event, CW decode, Goertzel, and tone frequency.
 * - Initialize display, load splash screen, and check/load user settings from NVS.
 * - Start display refresh timer and resume display update task.
 * - Initialize Goertzel algorithm and ADC for continuous DMA conversion.
 * - Register ADC event callbacks and start ADC conversion.
 * - Configure and start DotClk hardware timer for CW timing.
 * - Enter main loop:
 *   - Manage splash screen timing and transitions.
 *   - Handle transitions to settings, scope, and help screens.
 *   - Process Bluetooth keyboard events and manage ADC/task suspension/resumption during pairing.
 *   - Process keyboard input and CW key events.
 *
 * @note This function runs indefinitely as the main application loop.
 */
void app_main()
{
  ModeCnt = 0;
  static const char *TAG = "Main Start";
  esp_log_level_set("*", ESP_LOG_ERROR); // ESP_LOG_NONE,       /*!< No log output */
											                   // ESP_LOG_ERROR,      /*!< Critical errors, software module can not recover on its own */
											                   // ESP_LOG_WARN,       /*!< Error conditions from which recovery measures have been taken */
											                   // ESP_LOG_INFO,       /*!< Information messages which describe normal flow of events */
											                   // ESP_LOG_DEBUG,      /*!< Extra information which is not necessary for normal use (values, pointers, sizes, etc). */
											                   // ESP_LOG_VERBOSE     /*!< Bigger chunks of debugging information, or frequent messages which can potentially flood the output. */
  // Configure CW send IO pin aka 'KEY'
  gpio_config_t io_conf;
  io_conf.intr_type = GPIO_INTR_DISABLE;
  io_conf.mode = GPIO_MODE_OUTPUT;
  io_conf.pin_bit_mask = (1ULL << KEY);
  io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
  io_conf.pull_up_en = GPIO_PULLUP_DISABLE;
  /*TODO BT Keyboard CW Send related code*/
  gpio_config(&io_conf);
  //digitalWrite(KEY, Key_Up); // key 'UP' state
  gpio_set_level(KEY, Key_Up); // key 'UP' state
  state_que = xQueueCreate(state_que_len, sizeof(uint8_t));
  RxSig_que  = xQueueCreate(RxSig_que_len, sizeof(int));
  KeyEvnt_que = xQueueCreate(KeyEvnt_que_len, sizeof(unsigned long));
  KeyState_que = xQueueCreate(KeyState_que_len, sizeof(uint8_t));
  ToneSN_que = xQueueCreate(ToneSN_que_len, sizeof(float));
  ToneSN_que2 = xQueueCreate(IntrvlBufSize, sizeof(float));
  ToneFrq_que = xQueueCreate(ToneFrq_que_len, sizeof(uint16_t));
  mutex = xSemaphoreCreateMutex();
  IIR_Coef_mutx = xSemaphoreCreateMutex();
  DsplUpDt_AdvPrsrTsk_mutx =  xSemaphoreCreateMutex();
  ADCread_disp_refr_timer_mutx = xSemaphoreCreateMutex();
  Calc_IIR_BPFltrCoef(750.0, SAMPLING_RATE, 3.7071);
  /*create DisplayUpDate Task*/
  xTaskCreatePinnedToCore(DisplayUpDt, "DisplayUpDate Task", 8192, NULL, 3, &DsplUpDtTaskHandle, 0);
  vTaskSuspend( DsplUpDtTaskHandle);

  /*Selected 2092 based on results found by using uxTaskGetStackHighWaterMark( NULL ) in AdvParserTask*/
  xTaskCreatePinnedToCore(
      AdvParserTask, /* Function to implement the task */
      "AdvParser Task", /* Name of the task */
      5148,  /*old Stack size in words 4096*/
      NULL,  /* Task input parameter */
      1,  /* Priority of the task */
      &AdvParserTaskHandle,  /* Task handle. */
      1); /* Core where the task should run */
  if (AdvParserTaskHandle == NULL)
    ESP_LOGI(TAG, "AdvParser Task handle FAILED");

  vTaskSuspend( AdvParserTaskHandle );
  //////////////////////////////////////////////
  xTaskCreatePinnedToCore(
      KeyEvntTask, /* Function to implement the task */
      "KeyEvnt Task", /* Name of the task */
      4096,  /* Stack size in words */
      NULL,  /* Task input parameter */
      12,  /* Priority of the task */
      &KeyEvntTaskTaskHandle,  /* Task handle. */
      1); /* Core where the task should run */
  if (KeyEvntTaskTaskHandle == NULL)
    ESP_LOGI(TAG, "KeyEvnt Task handle FAILED");

