jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  vTaskSuspend( KeyEvntTaskTaskHandle );
///////////////////////////////////////////////  
  
  xTaskCreatePinnedToCore(
      CWDecodeTask, /* Function to implement the task */
      "CW Decode Task", /* Name of the task */
      8192,  /* Stack size in words */
      NULL,  /* Task input parameter */
      4,  /* Priority of the task */
      &CWDecodeTaskHandle,  /* Task handle. */
      0); /*Core 0 or 1 */
  
  if (CWDecodeTaskHandle == NULL)
    ESP_LOGI(TAG, "CW Decoder Task handle FAILED");

  //xTaskCreatePinnedToCore(GoertzelHandler, "Goertzel Task", 8192, NULL, 10, &GoertzelTaskHandle, 1); // priority used to be 3
  /*20250814 trying a smaller stack size to stop mysterious memory allocation chashes during ble pairing process*/
  xTaskCreatePinnedToCore(GoertzelHandler, "Goertzel Task", 4096, NULL, 10, &GoertzelTaskHandle, 1);
  if (GoertzelTaskHandle == NULL)
    ESP_LOGI(TAG, "Goertzel Task Task handle FAILED");

  xTaskCreatePinnedToCore(ToneFreqTask, "ToneFreq Task", 3072, NULL, 1, &ToneFreqTaskHandle, tskNO_AFFINITY); 
  if (ToneFreqTaskHandle == NULL)
    ESP_LOGI(TAG, "ToneFreq Task Task_handle FAILED");  
  vTaskSuspend(ToneFreqTaskHandle);    
  /*Setup Software Display Refresh/Update timer*/
  DisplayTmr = xTimerCreate(
      "Display-Refresh-Timer",
      pdMS_TO_TICKS(33), //33 / portTICK_PERIOD_MS i.e. 30Fps
      pdTRUE,
      (void *)1,
      DsplTmr_callback);
  /*designated Memory space for ADC sample sets to land at)*/
  memset(result, 0xcc, (SOC_ADC_DIGI_RESULT_BYTES * Goertzel_SAMPLE_CNT)); // 1 byte for the channel # & 1 byte for the data
  
  // ADC_smpl_mutex = xSemaphoreCreateMutex();

  /*setup Hardware DOT Clock timer & link to timer ISR*/
  const esp_timer_create_args_t DotClk_args = {
      .callback = &DotClk_ISR,
      .arg = NULL,
      .dispatch_method = ESP_TIMER_ISR,
      .name = "DotClck"};

  ESP_ERROR_CHECK(esp_timer_create(&DotClk_args, &DotClk_hndl));

  
  /* The timer has been created but is not running yet */
//intr_matrix_set(xPortGetCoreID(), ETS_TG0_T1_LEVEL_INTR_SOURCE, 26); // ESP32
intr_matrix_set(xPortGetCoreID(), XCHAL_TIMER1_INTERRUPT, 26);// ESP32S3 added this entry/setting for waveshare display dev baord
 ESP_INTR_ENABLE(26); // display

 // To test the Pairing code entry, uncomment the following line as pairing info is
  // kept in the nvs. Pairing will then be required on every boot.
  // ret = nvs_flash_init();
  // ESP_ERROR_CHECK(nvs_flash_erase());
  ret = nvs_flash_init();
  if ((ret == ESP_ERR_NVS_NO_FREE_PAGES) || (ret == ESP_ERR_NVS_NEW_VERSION_FOUND))
  {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);
  
  /*Initialize display and load splash screen*/
  lvglmsgbx.InitDsplay();
  // sprintf(Title, " ESP32s3 CW Machine (%s)\n", RevDate); // sprintf(Title, "CPU CORE: %d\n", (int)xPortGetCoreID());
  // lvglmsgbx.dispDeCdrTxt(Title, TFT_SKYBLUE);

  /* test/check NVS to see if user setting/param have been stored */
  uint8_t Rstat = Read_NVS_Str("MyCall", DFault.MyCall);
  if (Rstat != 1)
  {
    /*No settings found; load factory settings*/
    sprintf(DFault.MyCall, "%s", MyCall);
    sprintf(DFault.MemF2, "%s", MemF2);
    sprintf(DFault.MemF3, "%s", MemF3);
    sprintf(DFault.MemF4, "%s", MemF4);
    sprintf(DFault.MemF5, "%s", MemF5);
    DFault.DeBug = DeBug;
    DFault.NiteMode = NiteMode;
    DFault.WPM = CWsndengn.GetWPM();
    DFault.ModeCnt = ModeCnt;
    DFault.AutoTune = AutoTune;
    DFault.TRGT_FREQ = (int)TARGET_FREQUENCYC;
    DFault.Grtzl_Gain = Grtzl_Gain;
    DFault.SlwFlg = SlwFlg;//'slow' mode (i.e., 4ms sample interval with 8ms dataset) no longer being used 20251025
    DFault.NoisFlg = NoisFlg;
    
    sprintf(Title, "\n        No stored USER params Found\n   Using FACTORY values until params are\n   'Saved' via the Settings Screen\n");
    lvglmsgbx.dispDeCdrTxt(Title, TFT_ORANGE);
  #if USE_KYBrd
  bt_keyboard.trapFlg = false;
  #endif /* USE_KYBrd*/
  }
  else
  {
    /*found 'mycall' stored setting, go get the other user settings */
    int strdAT;
    Rstat = Read_NVS_Str("MemF2", DFault.MemF2);
    Rstat = Read_NVS_Str("MemF3", DFault.MemF3);
    Rstat = Read_NVS_Str("MemF4", DFault.MemF4);
    Rstat = Read_NVS_Str("MemF5", DFault.MemF5);
    Rstat = Read_NVS_Val("DeBug", DFault.DeBug);
    Rstat = Read_NVS_Val("NiteMode", strdAT);
    DFault.NiteMode = (bool)strdAT;
    NiteMode = DFault.NiteMode;
    Rstat = Read_NVS_Val("WPM", DFault.WPM);
    Rstat = Read_NVS_Val("ModeCnt", DFault.ModeCnt);
    Rstat = Read_NVS_Val("TRGT_FREQ", DFault.TRGT_FREQ);
    int intGainVal; // uint64_t intGainVal;
    Rstat = Read_NVS_Val("Grtzl_Gain", intGainVal);
    DFault.Grtzl_Gain = (float)intGainVal / 10000000.0;
    Rstat = Read_NVS_Val("AutoTune", strdAT);
    DFault.AutoTune = (bool)strdAT;
    Rstat = Read_NVS_Val("SlwFlg", strdAT);
    DFault.SlwFlg = (bool)strdAT;
    Rstat = Read_NVS_Val("NoisFlg", strdAT);
    DFault.NoisFlg = (bool)strdAT;
    /*pass the decoder se vTaskDelay(5000 / portTICK_PERIOD_MS);tting(s) back to their global counterpart(s) */
    AutoTune = DFault.AutoTune;
    SlwFlg = DFault.SlwFlg;//'slow' mode (i.e., 4ms sample interval with 8ms dataset) no longer being used 20251025
    NoisFlg = DFault.NoisFlg;
    NiteMode = DFault.NiteMode;
    ModeCnt = DFault.ModeCnt;
    DeBug = DFault.DeBug;
    TARGET_FREQUENCYC = (float)DFault.TRGT_FREQ;
    Grtzl_Gain = DFault.Grtzl_Gain;
  }
  lvglmsgbx.FlipDayNiteMode(); //set display to light or dark mode based on stored Dfault setting
  lvglmsgbx.BldSplashScreen();
  /* Start the Display timer */
  xTimerStart(DisplayTmr, portMAX_DELAY);
  vTaskResume( DsplUpDtTaskHandle);
  
  InitGoertzel();
  /*This delay is just to give time for an external USB serrial monitor to get up and running*/
  // vTaskDelay(5000 / portTICK_PERIOD_MS);
 
    #if USE_KYBrd
  bt_keyboard.inPrgsFlg = false;
  if(DFault.DeBug)
  {
    vTaskDelay(pdMS_TO_TICKS(500));
    printf("\n");
  }  
  /*start bluetooth pairing/linking process*/
    if (bt_keyboard.setup(pairing_handler, &bt_keyboard )) // Must be called once
  { 
    /*Start BLE Scan */ 
    xTaskCreatePinnedToCore(BLE_scan_tsk, "BLE Scan Task", 8192, NULL, 1, &BLEscanTask_hndl, 0);
  }
  else
  {
    printf("bt_keyboard.setup(pairing_handler) FAILED!!\n");
    printf("!!PROGRAM HALTED!!\n");
    sprintf(Title, "\n*******  RESTART!  ******\n** NO KEYBOARD PAIRED ***");
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
    while (true)
    {
      /*do nothiing*/
      vTaskDelay(pdMS_TO_TICKS(20));
    }
  }
#endif /* USE_KYBrd*/
  /*initialize & start continuous DMA ADC conversion process*/
  Cw_Machine_ADC_init(channel, sizeof(channel) / sizeof(adc_channel_t), &adc_handle);
  
