jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  adc_continuous_evt_cbs_t cbs = {
      .on_conv_done = s_conv_done_cb,
  };
  ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, NULL));
  ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
  adcON = true;
  xTaskNotifyGive(CWDecodeTaskHandle);
  vTaskDelay(200 / portTICK_PERIOD_MS);
  
  ESP_LOGI(TAG, "Start DotClk interrupt Config");
  //ESP_ERROR_CHECK(esp_intr_alloc(ETS_TG0_T1_LEVEL_INTR_SOURCE, ESP_INTR_FLAG_LEVEL3, DotClk_ISR, DotClk_args.arg, NULL));
  ESP_ERROR_CHECK(esp_intr_alloc(XCHAL_TIMER1_INTERRUPT, ESP_INTR_FLAG_LEVEL3, DotClk_ISR, DotClk_args.arg, NULL));// ESP32S3 added this entry/setting for waveshare display dev baord
  ESP_LOGI(TAG, "End DotClk interrupt Config"); 
 /* Start the timer dotclock (timer)*/
  ESP_ERROR_CHECK(esp_timer_start_periodic(DotClk_hndl, 60000)); // 20WPM or 60ms
  CWsndengn.RfrshSpd = true;
  CWsndengn.ShwWPM(DFault.WPM); // calling this method does NOT recalc/set the dotclock & show the WPM
  CWsndengn.SetWPM(DFault.WPM); // 20230507 Added this seperate method call after changing how the dot clocktiming gets updated
  CWsndengn.UpDtWPM = true;
  // const TickType_t xDelay = 3000 / portTICK_PERIOD_MS;
	// vTaskDelay(xDelay);
  // lvglmsgbx.ReStrtMainScrn();
  // lv_img_cache_invalidate_src(NULL);//Supposedly this removes the splash screen image from memory 
  /* main CW keyboard loop*/
  bool SplashScrnActv = true;
  uint16_t SplashScrnLpCntr = 0;
  uint16_t MaxSplashSrnCnt = (uint16_t)(100*SplashHangTime);
  while (true)
  {
#if 1 // 0 = scan codes retrieval, 1 = augmented ASCII retrieval
    /* note: this now loops continuously */

    vTaskDelay(pdMS_TO_TICKS(10)); // give the watchdogtimer a chance to reset
    //printf("main loop\n");
    if(SplashScrnActv)
    {
      SplashScrnLpCntr++;
      if(SplashScrnLpCntr>MaxSplashSrnCnt)// reconfigure to kill flashScreen on reaching MaxSplashSrnCnt
      {
        SplashScrnActv = false;
        KillSplashScrn = true;
      }
    }
    if(KillSplashScrn)
    {
      KillSplashScrn = false;
      SplashScrnActv = false;
      lvglmsgbx.ReStrtMainScrn();
      lv_img_cache_invalidate_src(NULL);//Supposedly this removes the splash screen image from memory
    } //else printf("KillSplashScrn = false\n");
    if (setupFlg)
    {
      // printf("setupFlg: 'true'\n");
      /*if true, exit main loop and jump to "settings" screen */
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /* if in decode mode 4, the adc DMA scan was never started*/
      if (ModeCnt != 4)
      {
        ESP_ERROR_CHECK(adc_continuous_stop(adc_handle)); // true; user has pressed Ctl+S key, & wants to configure default settings
        adcON = false;
        printf("setupFlg = true\n");
        vTaskSuspend(GoertzelTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND GoertzelHandler TASK");
        vTaskSuspend(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND CWDecodeTaskHandle TASK");
        // vTaskSuspend(DsplUpDtTaskHandle);
        // ESP_LOGI(TAG1, "SUSPEND DsplUpDtTaskHandle TASK");
        vTaskDelay(20);
      }
      /*Now ready to jump to "settings" screen */
      lvglmsgbx.BldSettingScreen();
      // ESP_LOGI(TAG1, "RESUME DsplUpDtTaskHandle TASK");
      // vTaskResume(DsplUpDtTaskHandle); 
      SettingsLoop(); // go here while settings screen is active
      advparser.Dbug = (bool)DFault.DeBug;
      if (DFault.NiteMode != NiteMode) lvglmsgbx.FlipDayNiteMode();;
      // else printf("advparser.Dbug OFF\n");
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
      if (ModeCnt != 4)
      {
        // Cw_Machine_ADC_init(channel, sizeof(channel) / sizeof(adc_channel_t), &adc_handle);
        // ESP_ERROR_CHECK(adc_continuous_register_event_callbacks(adc_handle, &cbs, NULL));
        ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
        adcON = true;
        ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
        vTaskResume(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
        vTaskResume(GoertzelTaskHandle);
        vTaskDelay(20);
      }
    }
    if (ScopeFlg)
    {
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /*Now ready to jump to "Scope" screen */
      lvglmsgbx.BldScopeScreen();
      ScopeLoop(); // go here while Scope screen is active
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
    }
    if (HelpFlg)
    {
      bool IntSOTstate = CWsndengn.GetSOTflg();
      if (IntSOTstate)
        CWsndengn.SOTmode();    // do this to stop any outgoing txt that might currently be in progress before switching over to settings screen
      lvglmsgbx.SaveSettings(); // save keyboard app's current display configuration; i.e., ringbuffer pointeres, etc. So that when the user closes the setting screen the keyboard app can conitnue fro where it left off
      /*Now ready to jump to "Scope" screen */
      lvglmsgbx.BldHelpScreen();
      HelpLoop(); // go here while Scope screen is active
      CWsndengn.RefreshWPM();
      if (IntSOTstate && !CWsndengn.GetSOTflg())
        CWsndengn.SOTmode(); // Send On Type was enabled when we went to 'settings' so re-enable it
    }
    /*Added this to support 'open' paired BT keyboard event*/

    switch (bt_keyboard.Adc_Sw)
    {
    case 1: // need to shut down all other spi activities, so the pending BT event has exclusive access to SPI
      bt_keyboard.Adc_Sw = 0;
      if (adcON && !CWsndengn.GetSOTflg()) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        ESP_LOGI(TAG1, "!!!adc_continuous_stop!!!");
        printf("CASE 2\n");
        ESP_ERROR_CHECK(adc_continuous_stop(adc_handle));
        adcON = false;
        vTaskSuspend(GoertzelTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND GoertzelHandler TASK");
        vTaskSuspend(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "SUSPEND CWDecodeTaskHandle TASK");
      }
      break;

    case 2: // BT event complete restore/resume all other spi activities
      bt_keyboard.Adc_Sw = 0;
      if (!adcON) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        ESP_LOGI(TAG1, "***adc_continuous_start***");
        ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
        adcON = true;
        ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
        vTaskResume(CWDecodeTaskHandle);
        ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
        vTaskResume(GoertzelTaskHandle);
        if (bt_keyboard.PairFlg && bt_keyboard.inPrgsFlg)
        {
          xTimerStart(DisplayTmr, portMAX_DELAY);
          // vTaskResume(DsplUpDtTaskHandle);
          bt_keyboard.PairFlg = false;
          bt_keyboard.inPrgsFlg = false;
          Title[0] = 0xFF;
          Title[0] = 0x0;
          lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
          ESP_LOGI(TAG2, "Pairing Complete; Display ON");
        }
      }
      break;

    default:
      break;
    } // end switch
    if (bt_keyboard.PairFlg && !bt_keyboard.inPrgsFlg)
    {
      xTimerStop(DisplayTmr, portMAX_DELAY);
      ESP_LOGI(TAG2, "Pairing Start; Display OFF");
      bt_keyboard.inPrgsFlg = true;
    }
    uint8_t key = 0;
    if (0) // set to '1' for flag debugging
    {
      if (bt_keyboard.OpnEvntFlg)
        printf("OpnEvntFlgTRUE");
      else
        printf("OpnEvntFlgFALSE");
      if (bt_keyboard.trapFlg)
        printf("; trapFlgTRUE\n");
      else
        printf("; trapFlgFALSE\n");

      // else
      //   printf("; PairFlgFALSE\n");
    }
    if (bt_keyboard.OpnEvntFlg && !bt_keyboard.trapFlg) // this gets set to true when the K380 KB generates corrupt keystroke data
      key = bt_keyboard.wait_for_ascii_char(false);     // true  // by setting to "true" this task/loop will wait 'forever' for a keyboard key press

    /*test key entry & process as needed*/
    if (key != 0)
    {
      ProcsKeyEntry(key);
    }

#else
#if USE_KYBrd
    BTKeyboard::KeyInfo inf;

    bt_keyboard.wait_for_low_event(inf);

    printf("RECEIVED KEYBOARD EVENT - Mod: %#X,  Keys: %#X, %#X, %#X \n", (uint8_t)inf.modifier, inf.keys[0], inf.keys[1], inf.keys[2]);
    // std::cout << "RECEIVED KEYBOARD EVENT: "
    //           << std::hex
    //           << "Mod: "
    //           << +(uint8_t)inf.modifier
    //           << ", Keys: "
    //           << +inf.keys[0] << ", "
    //           << +inf.keys[1] << ", "
    //           << +inf.keys[2] << std::endl;
#endif /* USE_KYBrd*/
#endif /* if(1||0)*/
  } /*End while loop*/
} /*End Main loop*/

