jmharvey1/ESP32S3_CW_Machine/src/main.cpp
    /*Normal setup */
    // if (ModeCnt == 4)
    // {
    //   ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
    //   vTaskResume(CWDecodeTaskHandle);
    //   ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
    //   vTaskResume(GoertzelTaskHandle);
    //   ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
    //   adcON =true;
    //   vTaskDelay(20);
    // }
    ModeCnt--;
    if (ModeCnt < 0)
      ModeCnt = 3;
    DFault.ModeCnt = ModeCnt;
    SetModFlgs(ModeCnt);
    CurMdStng(ModeCnt); // added 20230104
    vTaskDelay(20);
    showSpeed();
    vTaskDelay(250);
    return;
  }
  else if ((keyVal == 0xA1))
  { // Cntrl+"G"; 
    /*20240123 Changed So that Ctrl+G now Enables/Disables Debug */
    if (DeBug)
    {
      DeBug = false;
      DFault.DeBug = false;
    }
    else
    {
      DeBug = true;
      DFault.DeBug = true;
    }
    return;
  }
  // else if ((keyVal ==  0xA1))
  // { /* special test for Left ctr+'g'
  //   reduce Goertzel gain*/
  //   Grtzl_Gain = Grtzl_Gain/2;
  //   if (Grtzl_Gain < 0.00390625) Grtzl_Gain  = 0.00390625;
  //   DFault.Grtzl_Gain = Grtzl_Gain;
  //   return;
  // }
  // else if ((keyVal ==  0xA2))
  // { /* special test for Right ctr+'g'
  //   increase Goertzel gain*/
  //   Grtzl_Gain = 2* Grtzl_Gain;
  //   if (Grtzl_Gain > 1.0) Grtzl_Gain  = 1.0;
  //   DFault.Grtzl_Gain = Grtzl_Gain;
  //   return;
  // }
  else if ((keyVal == 0xA2))
  { // "PgUp +Shift" key pressed (DecdTxtArea Scroll up)
    bool up = true;
    int TAid = 0; // Text Area ID = 0 -> DecdTxtArea
    lvglmsgbx.ScrollTA(up, TAid);
    return;
  }
  else if ((keyVal == 0xA3))
  { // "PgUp +Ctrl" key pressed (SendTxtArea Scroll up)
    bool up = true;
    int TAid = 1; // Text Area ID = 1 -> SendTxtArea
    lvglmsgbx.ScrollTA(up, TAid);
    return;
  }
   else if ((keyVal == 0xA4))
  { // "PgDwn +Shift" key pressed (DecdTxtArea Scroll down)
    bool up = false;
    int TAid = 0; // Text Area ID = 1 -> DecdTxtArea
    lvglmsgbx.ScrollTA(up, TAid);
    return;
  }
  else if ((keyVal == 0xA5))
  { // "PgDwn +Ctrl" key pressed (SendTxtArea Scroll down)
    bool up = false;
    int TAid = 1; // Text Area ID = 1 ->SendTxtArea
    lvglmsgbx.ScrollTA(up, TAid);
    return;
  }
  else if ((keyVal == 0xA6))
  { // "H +Ctrl" key pressed (Help screen)
    HelpFlg = !HelpFlg;
    return;
  }
  if ((keyVal >= 97) & (keyVal <= 122)) // decimal ASCII values for lower case letters
  { /*its a lower case letter; convert to upper case ASCII */
    keyVal = keyVal - 32;
  }
  char Ltr2Bsent = (char)keyVal;
  switch (Ltr2Bsent)
  {
  case '=':
    addspce = true; //<BT>
    break;
  case '+':
    addspce = true; //<KN>
    break;
  case '%':
    addspce = true;
    ; //<SK>
    break;
  case '>':
    addspce = true; //<BT>
    break;
  case '<':
    addspce = true; //<BT>
    break;
  }
  if (addspce && CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
    CWsndengn.AddNewChar(&SpcChr);
  CWsndengn.AddNewChar(&Ltr2Bsent);
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/**
 * @brief Handles the settings screen loop for user interaction.
 *
 * This function manages the settings UI, allowing the user to navigate between parameters,
 * modify values, and exit the settings screen. It uses keyboard input to detect navigation
 * (arrow up/down) and exit commands (Ctrl+S). When exiting, it synchronizes the current
 * settings with default parameters and updates the CW send engine if necessary.
 *
 * The function also ensures thread-safe access to the LVGL display by using a semaphore,
 * and periodically refreshes the display. Focus changes between parameters are highlighted,
 * and keyboard entries are processed for the currently selected parameter.
 *
 * @note This loop runs while `setupFlg` is true and exits when the user requests to leave
 *       the settings screen.
 */
void SettingsLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 10;
  bool FocusChngd = false;
  int oldparamPtr = 0;
  lvglmsgbx.HiLite_Seltcd_Setting(paramPtr, oldparamPtr);
  while (setupFlg)
  {
    if (xSemaphoreTake(lvgl_semaphore, portMAX_DELAY) == pdTRUE) // wait forever
    {
      _lv_disp_refr_timer(NULL);
      xSemaphoreGive(lvgl_semaphore);
    }
    vTaskDelay(pdMS_TO_TICKS(100));
    // printf("while(setupFlg)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x9C) //= "crtl+s"
    {
      /*user wants to exit setting screen
      So 1st pass the current sttetings entries back to their respective DFault parameters*/
      lvglmsgbx.syncDfltwSettings();
      CWsndengn.SetWPM(DFault.WPM); // syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      setupFlg = false;
    }
    else if (key == 0x98)
    { // Arrow UP
      key = 0;
      // NtryBoxGrp[paramPtr].KillCsr();
      oldparamPtr = paramPtr;
      paramPtr--;
      FocusChngd = true;
    }
    else if (key == 0x97)
    { // Arrow DOWN
      key = 0;
      // NtryBoxGrp[paramPtr].KillCsr();
      oldparamPtr = paramPtr;
      paramPtr++;
      FocusChngd = true;
    }
    if (paramPtr == paramCnt)
      paramPtr = 0;
    if (paramPtr < 0)
      paramPtr = paramCnt - 1;
    if (FocusChngd)
    {
      lvglmsgbx.HiLite_Seltcd_Setting(paramPtr, oldparamPtr);
      FocusChngd = false;
    }
    else if (key != 0)
    {
      lvglmsgbx.KBentry(key, paramPtr);
    }
    if (!setupFlg)
    {
      lvglmsgbx.Exit_Settings(paramPtr);
      lvglmsgbx.ReStrtMainScrn();
    }
  }
};

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void ScopeLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 9;
  bool FocusChngd = false;
  int oldparamPtr = 0;
  ScopeActive = true;
  while (ScopeFlg)
  {
    vTaskDelay(pdMS_TO_TICKS(100));
    //printf("while(ScopeLoop)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x89) //= "F9"
    {
      /*user wants to exit Scope screen*/
      CWsndengn.SetWPM(DFault.WPM);//syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      ScopeActive = false;
      ScopeFlg = false;
    }
    
