jmharvey1/ESP32S3_CW_Machine/src/main.cpp
  }
  lvglmsgbx.ReStrtMainScrn();
  vTaskDelay(pdMS_TO_TICKS(25));
};
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void HelpLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 9;
  bool FocusChngd = false;
  bool RefreshDspl = false;
  int oldparamPtr = 0;
  ScopeActive = true;
  while (HelpFlg)
  {
    vTaskDelay(pdMS_TO_TICKS(100));
    RefreshDspl = true;
    // printf("while(ScopeLoop)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x89 || key == 0xA6) //= "F9"
    {
      /*user wants to exit Help screen*/
      CWsndengn.SetWPM(DFault.WPM); // syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      // ScopeActive = false;
      HelpFlg = false;
    }
    else if (key == 0x98)
    { // Arrow UP
      bool up = true;
      int TAid = 2; // Text Area ID = 2 -> Helpta
      lvglmsgbx.ScrollTA(up, TAid);
      RefreshDspl = false;
    }
    else if (key == 0x97)
    { // Arrow DOWN
      bool up = false;
      int TAid = 2; // Text Area ID = 2 -> Helpta
      lvglmsgbx.ScrollTA(up, TAid);
      RefreshDspl = false;
    }
    if (RefreshDspl)
    {
      if (pdTRUE == xSemaphoreTake(lvgl_semaphore, 200 / portTICK_PERIOD_MS))
      {
        _lv_disp_refr_timer(NULL);
        xSemaphoreGive(lvgl_semaphore);
      }
      else
        ESP_LOGE("ERROR", "ScrollTA: xSemaphoreTake(lvgl_semaphore) FAILED");
    }
  }
  lvglmsgbx.ReStrtMainScrn();
  vTaskDelay(pdMS_TO_TICKS(25));
};
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* the following code handles the read from & write to NVS processes needed to handle the User CW prefences/settings  */

uint8_t Read_NVS_Str(const char *key, char *value)
/* read string data from NVS*/
{
  uint8_t stat = 0;
  // const uint16_t* p = (const uint16_t*)(const void*)&value;
  //  Handle will automatically close when going out of scope or when it's reset.
  std::unique_ptr<nvs::NVSHandle> handle = nvs::open_nvs_handle("storage", NVS_READWRITE, &ret);
  if (ret != ESP_OK)
  {
    sprintf(Title, "Error (%s) opening READ NVS string handle for: %s!\n", esp_err_to_name(ret), key);
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
  }
  else
  {
    size_t required_size;
    ret = handle->get_item_size(nvs::ItemType::SZ, key, required_size);
    switch (ret)
    {
    case ESP_OK:

      if (required_size > 0 && required_size < 100)
      {
        char temp[100];
        ret = handle->get_string(key, temp, required_size);
        int i;
        for (i = 0; i < 100; i++)
        {
          value[i] = temp[i];
          if (temp[i] == 0)
            break;
        }
        if (DFault.DeBug)
        {
          sprintf(Title, "%d characters copied to %s\n", i, key);
          lvglmsgbx.dispDeCdrTxt(Title, TFT_BLUE);
        }
        stat = 1;
      }
      break;
    case ESP_ERR_NVS_NOT_FOUND:
      /*TODO could need support code here*/
      break;
    default:
      sprintf(Title, "Error (%s) reading %s!\n", esp_err_to_name(ret), key);
      lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      //delay(3000);
      vTaskDelay(pdMS_TO_TICKS(3000));
    }
  }
  return stat;
}
/////////////////////////////////////////////////////////////
template <class T>
uint8_t Read_NVS_Val(const char *key, T &value)
/* read numeric data from NVS*/
{
  uint8_t stat = 0;
  // const uint16_t* p = (const uint16_t*)(const void*)&value;
  //  Handle will automatically close when going out of scope or when it's reset.
  std::unique_ptr<nvs::NVSHandle> handle = nvs::open_nvs_handle("storage", NVS_READWRITE, &ret);
  if (ret != ESP_OK)
  {
    sprintf(Title, "Error (%s) opening READ NVS value handle for: %s!\n", esp_err_to_name(ret), key);
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
  }
  else
  {
    ret = handle->get_item(key, value);
    switch (ret)
    {
    case ESP_OK:
      stat = 1;
      break;
    case ESP_ERR_NVS_NOT_FOUND:
      sprintf(Title, "%s value is not initialized yet!\n", key);
      lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      break;
    default:
      sprintf(Title, "Error (%s) reading %s!\n", esp_err_to_name(ret), key);
      lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      //delay(3000);
      vTaskDelay(pdMS_TO_TICKS(3000));
    }
  }
  return stat;
}

/*Save data to NVS memory routines*/

uint8_t Write_NVS_Str(const char *key, char *value)
/* write string data to NVS */
{
  uint8_t stat = 0;
  //  Handle will automatically close when going out of scope or when it's reset.
  std::unique_ptr<nvs::NVSHandle> handle = nvs::open_nvs_handle("storage", NVS_READWRITE, &ret);
  if (ret != ESP_OK)
  {
    // printf("Error (%s) opening NVS handle!\n", esp_err_to_name(ret));
    sprintf(Title, "Error (%s) opening WRITE NVS string handle for: %s!\n", esp_err_to_name(ret), key);
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
  }
  else
  {

    ret = handle->set_string(key, value);
    switch (ret)
    {
    case ESP_OK:
      /* write operation worked; go ahead and /lock the data in */
      ret = handle->commit();
      if (ret != ESP_OK)
      {
        sprintf(Title, "Commit Failed (%s) on %s!\n", esp_err_to_name(ret), key);
        lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      }
      else
      {
        /* exit point when everything works as it should */
        stat = 1;
        break;
      }
    default:
      sprintf(Title, "Error (%s) reading %s!\n", esp_err_to_name(ret), key);
      lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      //delay(3000);
      vTaskDelay(pdMS_TO_TICKS(3000));
    }
  }
  return stat;
}
/////////////////////////////////////////////////////////////

uint8_t Write_NVS_Val(const char *key, int value)
/* write numeric data to NVS; If the data is "stored",return with an exit status of "1" */
{
  uint8_t stat = 0;
  // const uint16_t* p = (const uint16_t*)(const void*)&value;
  //  Handle will automatically close when going out of scope or when it's reset.
  std::unique_ptr<nvs::NVSHandle> handle = nvs::open_nvs_handle("storage", NVS_READWRITE, &ret);
  if (ret != ESP_OK)
  {
    sprintf(Title, "Error (%s) opening WRITE NVS value handle for: %s!\n", esp_err_to_name(ret), key);
    lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
  }
  else
  {
    ret = handle->set_item(key, value);
    switch (ret)
    {
    case ESP_OK:
      ret = handle->commit();
      if (ret != ESP_OK)
      {
        sprintf(Title, "Commit Failed (%s) on %s!\n", esp_err_to_name(ret), key);
        lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      }
      else
        /* exit point when everything works as it should */
        stat = 1;
      break;
    default:
      sprintf(Title, "Error (%s) reading %s!\n", esp_err_to_name(ret), key);
      lvglmsgbx.dispDeCdrTxt(Title, TFT_RED);
      //delay(3000);
      vTaskDelay(pdMS_TO_TICKS(3000));
    }
  }
  return stat;
}
////////////////////////////////////////////////////////////
void Calc_IIR_BPFltrCoef(float Fc, float Fs, float Q) {

	float K = tan(M_PI * ((Fc) / Fs));//manual method
	//float K = tan(M_PI * ((Fc*4) /(0.96 * Fs))); // CMSIS-DSP process; Note Decimate factor is 1/2 that of the manual method
	float norm = 1 / (1 + K / Q + K * K);

	a0 = (K / Q) * norm;
	a1 = 0;
	a2 = -a0;
	b1 = 2 * (K * K - 1) * norm;
	b2 = (1 - K / Q + K * K) * norm;
//  printf("a0 %.4f; a1 %.4f;a2 %.4f; b1 %.4f; b2 %.4f\n",a0, a1, a2, b1, b2);
//	Coeffs[0] = Coeffs[5] = +a0;
//	Coeffs[1] = Coeffs[6] = +a1;
//	Coeffs[2] = Coeffs[7] = +a2;
//	Coeffs[3] = Coeffs[8] = -b1;
//	Coeffs[4] = Coeffs[9] = -b2;
	/*initialize CMSIS IIR Filter global state structure "S1" */
//	arm_biquad_cascade_df2T_init_f32(&S1, numStages, Coeffs, State);

}

